; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v10 ?v5)
             (pred_3 ?v3 ?v6)
             (pred_8 ?v10 ?v6)
             (pred_4 ?v12 ?v10 )
	     (pred_11 ?v10)
             (pred_7 ?v2)
             (pred_6 ?v3)
             (pred_12 ?v6)
             (pred_5 ?v10)
             (pred_1 ?v3)
             (pred_10 ?v10)
             (pred_9 ))



(:action op_3
:parameters (?v4 ?v1 ?v11 ?v7)
:precondition (and (pred_7 ?v4) (pred_7 ?v1) (pred_6 ?v11) (pred_12 ?v7)
          (pred_2 ?v4 ?v1) (pred_3 ?v11 ?v7)
                   (pred_8 ?v1 ?v7) (pred_11 ?v4) 
                   (pred_5 ?v1) (pred_1 ?v11))
:effect (and  (pred_10 ?v1) (not (pred_5 ?v1))))


(:action op_5
:parameters (?v4 ?v9)
:precondition (and (pred_7 ?v4) (pred_7 ?v9)
               (pred_11 ?v4) (pred_2 ?v4 ?v9) (pred_10 ?v9))
:effect (and (pred_11 ?v9) (not (pred_11 ?v4))))

(:action op_1
:parameters (?v4 ?v11)
:precondition (and (pred_7 ?v4) (pred_6 ?v11) 
                  (pred_11 ?v4) (pred_4 ?v11 ?v4) (pred_9 ))
:effect (and (pred_1 ?v11)
   (not (pred_4 ?v11 ?v4)) (not (pred_9 ))))


(:action op_2
:parameters (?v4 ?v8 ?v13)
:precondition (and (pred_7 ?v4) (pred_6 ?v8) (pred_6 ?v13)
                  (pred_11 ?v4) (pred_1 ?v13) (pred_4 ?v8 ?v4))
:effect (and (pred_1 ?v8) (pred_4 ?v13 ?v4)
        (not (pred_1 ?v13)) (not (pred_4 ?v8 ?v4))))

(:action op_4
:parameters (?v4 ?v11)
:precondition (and (pred_7 ?v4) (pred_6 ?v11) 
                  (pred_11 ?v4) (pred_1 ?v11))
:effect (and (pred_9 ) (pred_4 ?v11 ?v4) (not (pred_1 ?v11)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_13 obj_05 obj_17 obj_16 obj_04 obj_12 obj_15 obj_14 obj_01 obj_18 obj_20 obj_09 obj_02 obj_06 obj_03 obj_19
    obj_11 obj_10
    obj_07 obj_08
    )

    (:init
       (pred_9)

       (pred_7 obj_13)
       (pred_7 obj_05)
       (pred_7 obj_17)
       (pred_7 obj_16)
       (pred_7 obj_04)
       (pred_7 obj_12)
       (pred_7 obj_15)
       (pred_7 obj_14)
       (pred_7 obj_01)
       (pred_7 obj_18)
       (pred_7 obj_20)
       (pred_7 obj_09)
       (pred_7 obj_02)
       (pred_7 obj_06)
       (pred_7 obj_03)
       (pred_7 obj_19)
       (pred_12 obj_11)
       (pred_12 obj_10)
       (pred_6 obj_07)
       (pred_6 obj_08)

       (pred_2 obj_13 obj_04)
       (pred_2 obj_13 obj_05)
       (pred_2 obj_05 obj_12)
       (pred_2 obj_05 obj_17)
       (pred_2 obj_05 obj_13)
       (pred_2 obj_17 obj_15)
       (pred_2 obj_17 obj_16)
       (pred_2 obj_17 obj_05)
       (pred_2 obj_16 obj_14)
       (pred_2 obj_16 obj_17)
       (pred_2 obj_04 obj_01)
       (pred_2 obj_04 obj_12)
       (pred_2 obj_04 obj_13)
       (pred_2 obj_12 obj_18)
       (pred_2 obj_12 obj_15)
       (pred_2 obj_12 obj_05)
       (pred_2 obj_12 obj_04)
       (pred_2 obj_15 obj_20)
       (pred_2 obj_15 obj_14)
       (pred_2 obj_15 obj_17)
       (pred_2 obj_15 obj_12)
       (pred_2 obj_14 obj_09)
       (pred_2 obj_14 obj_16)
       (pred_2 obj_14 obj_15)
       (pred_2 obj_01 obj_02)
       (pred_2 obj_01 obj_18)
       (pred_2 obj_01 obj_04)
       (pred_2 obj_18 obj_06)
       (pred_2 obj_18 obj_20)
       (pred_2 obj_18 obj_12)
       (pred_2 obj_18 obj_01)
       (pred_2 obj_20 obj_03)
       (pred_2 obj_20 obj_09)
       (pred_2 obj_20 obj_15)
       (pred_2 obj_20 obj_18)
       (pred_2 obj_09 obj_19)
       (pred_2 obj_09 obj_14)
       (pred_2 obj_09 obj_20)
       (pred_2 obj_02 obj_06)
       (pred_2 obj_02 obj_01)
       (pred_2 obj_06 obj_03)
       (pred_2 obj_06 obj_18)
       (pred_2 obj_06 obj_02)
       (pred_2 obj_03 obj_19)
       (pred_2 obj_03 obj_20)
       (pred_2 obj_03 obj_06)
       (pred_2 obj_19 obj_09)
       (pred_2 obj_19 obj_03)
       (pred_5 obj_02)
       (pred_5 obj_13)
       (pred_8  obj_02 obj_11)
       (pred_8  obj_13 obj_10)
       (pred_10 obj_05)
       (pred_10 obj_17)
       (pred_10 obj_16)
       (pred_10 obj_04)
       (pred_10 obj_12)
       (pred_10 obj_15)
       (pred_10 obj_14)
       (pred_10 obj_01)
       (pred_10 obj_18)
       (pred_10 obj_20)
       (pred_10 obj_09)
       (pred_10 obj_06)
       (pred_10 obj_03)
       (pred_10 obj_19)

       (pred_3  obj_07 obj_11)
       (pred_3  obj_08 obj_10)
       (pred_4 obj_07 obj_18)
       (pred_4 obj_08 obj_19)
       (pred_11 obj_01)
    )

    (:goal (and
       (pred_4 obj_07 obj_05)
       (pred_4 obj_08 obj_03)
    ))
(:constraints
  (always (not (pred_11 obj_20)))
)
)

; plan
1. (op_5 obj_01 obj_18)
   deleted: (pred_11 obj_01)
   added: (pred_11 obj_18)
   goals met: 0 of 2
2. (op_1 obj_18 obj_07)
   deleted: (pred_4 obj_07 obj_18) (pred_9)
   added: (pred_1 obj_07)
   goals met: 0 of 2
3. (op_5 obj_18 obj_12)
   deleted: (pred_11 obj_18)
   added: (pred_11 obj_12)
   goals met: 0 of 2
4. (op_5 obj_12 obj_15)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_15)
   goals met: 0 of 2
5. (op_5 obj_15 obj_14)
   deleted: (pred_11 obj_15)
   added: (pred_11 obj_14)
   goals met: 0 of 2
6. (op_5 obj_14 obj_09)
   deleted: (pred_11 obj_14)
   added: (pred_11 obj_09)
   goals met: 0 of 2
7. (op_5 obj_09 obj_19)
   deleted: (pred_11 obj_09)
   added: (pred_11 obj_19)
   goals met: 0 of 2
8. (op_2 obj_19 obj_08 obj_07)
   deleted: (pred_1 obj_07) (pred_4 obj_08 obj_19)
   added: (pred_1 obj_08) (pred_4 obj_07 obj_19)
   goals met: 0 of 2
9. (op_5 obj_19 obj_03)
   deleted: (pred_11 obj_19)
   added: (pred_11 obj_03)
   goals met: 0 of 2
10. (op_4 obj_03 obj_08)
   deleted: (pred_1 obj_08)
   added: (pred_9) (pred_4 obj_08 obj_03)
   goals met: 1 of 2
11. (op_5 obj_03 obj_19)
   deleted: (pred_11 obj_03)
   added: (pred_11 obj_19)
   goals met: 1 of 2
12. (op_1 obj_19 obj_07)
   deleted: (pred_4 obj_07 obj_19) (pred_9)
   added: (pred_1 obj_07)
   goals met: 1 of 2
13. (op_5 obj_19 obj_09)
   deleted: (pred_11 obj_19)
   added: (pred_11 obj_09)
   goals met: 1 of 2
14. (op_5 obj_09 obj_14)
   deleted: (pred_11 obj_09)
   added: (pred_11 obj_14)
   goals met: 1 of 2
15. (op_5 obj_14 obj_16)
   deleted: (pred_11 obj_14)
   added: (pred_11 obj_16)
   goals met: 1 of 2
16. (op_5 obj_16 obj_17)
   deleted: (pred_11 obj_16)
   added: (pred_11 obj_17)
   goals met: 1 of 2
17. (op_5 obj_17 obj_05)
   deleted: (pred_11 obj_17)
   added: (pred_11 obj_05)
   goals met: 1 of 2
18. (op_4 obj_05 obj_07)
   deleted: (pred_1 obj_07)
   added: (pred_9) (pred_4 obj_07 obj_05)
   goals met: 2 of 2
